{
    "689272502597189682": {
        "title": "TechTok Rules",
        "preamble": "Welcome to TechTok we are a community founded around both TikTok and Technology. Before entering our server please read over the following rules:",
        "rules": [
            {
                "title": "Keep it safe for work",
                "body": "No porn, gore, swearing, politics or discussion of adult content.",
                "disclaimer": "The Staff Team reserves the right to change your nickname to make it easier to ping/make it appropriate."
            },
            {
                "title": "Nothing illegal",
                "body": "If you are talking about hacking you have to keep it white hat, we are here to learn and discuss things. We are not here to help you get into your ex girlfriend's social media accounts."
            },
            {
                "title": "Don't be a dick",
                "body": "We are all here to learn, pulling any attitudes that are meant to make yourself seem better than someone else or are meant to put someone else down are not okay and will get you kicked. This also includes the use of slurs, we are not here to see how many insulting words you know."
            },
            {
                "title": "Don't be a dick, Return of the prick",
                "body": "The mods and admins are here to help, don't give them stress. And don't give the content creators stress. We are more than willing to help answer questions but pinging us repeatedly and demanding our attention will just get you kicked."
            },
            {
                "title": "Keep it organized",
                "body": "We have channels for each major topic, please use them properly. If there is a category we are missing feel free to tell us in the #suggestions channel. (Suggest by heading into #bot-commands and using `!suggest <your idea here>`)"
            },
            {
                "title": "Respect Everyone Privacy",
                "disclaimer": "While you may need to contact staff in emergencies such as harassment or bullying or any other server issue we ask you try to use the ticketing system. WE will attempt to keep our DMs open but please do not abuse this or it will lead to warnings and eventually you being banned!!!! A good rule of thumb is if more than one admin/mod could answer the issue then you should post it in the server. Again just remember to obtain permission before you message (except for in the case of an emergency).",
                "body": "Do not slide into someone’s DMs without consent, this also includes randomly adding someone. Stay classy."
            },
            {
                "title": "Self-Harm",
                "body": "No suicidal or self harm comments, statements, pictures, etc. This breaks TOS. (if you need help or need someone to talk to head over to #mental-health-assistance-channel or create a ticket to talk to a member of staff)"
            },
            {
                "title": "No Spam",
                "body": "No spam of any kind, this includes but not limited too, emote, tagging, words, etc."
            },
            {
                "title": "Self-Promotion",
                "body": "DO NOT SELF PROMOTE IN DMS. There is a channel for this, discord sniping is not allowed."
            },
            {
                "title": "Primary Language",
                "body": "This is a primarily English speaking server, please keep all conversations in English."
            },
            {
                "title": "Respect Staff",
                "body": "Respect all Admins/mods. TechTok hand picked them for a reason."
            },
            {
                "title": "Equal opportunity",
                "body": "We promote equal opportunity in this server. if you are found to be posting/sharing racist, homophonic, sexist, etc. you will be banned from our services."
            },
            {
                "title": "False Reporting",
                "body": "If you are found to be falsely reporting users in #malicious-users you will be warned if this happens more then once it will result in a ban from our services"
            },
            {
                "title": "Read the Manual",
                "body": "Please remember that while we are here to help each other it is important to do your research as well. That being said before reaching for help try to Google the issue or read the manual first."
            },
            {
                "title": "Discrimination Continued",
                "body": "We are a safe for work safe for all server. This means that you are expected to show respect to all others in the server no matter their background, employment or experience. We all have to start somewhere and just because we work someone doesn't always mean we agree with the client/employers views!"
            },
            {
                "title": "Bot Spam",
                "body": "Please keep all bot commands to the bot spam channel unless you are tipping someone with tip.cc"
            }
        ]
    }
}